app/controllers/admin/categories_controller.rb

	def update
		@category = Category.find(params[:id])
		if @category.update(category_params)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "categories" SET "updated_at" = ?, "details" = ? WHERE "categories"."id" = ?  [["updated_at", "2022-12-08 08:19:32.910802"], ["details", "some detailssss"], ["id", 18]]