app/controllers/admin/products_controller.rb

INSERT INTO "products" ("name", "description", "quantity", "barcode", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", nil], ["description", "vfankd"], ["quantity", nil], ["barcode", ""], ["price", nil], ["created_at", "2022-11-23 14:24:51.039536"], ["updated_at", "2022-11-23 14:24:51.039536"]]
---
	def create
		@product = Product.new(product_params)
		if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
UPDATE "products" SET "name" = ?, "description" = ?, "stock" = ?, "price" = ?, "updated_at" = ?, "sku" = ?, "weight" = ? WHERE "products"."id" = ?  [["name", "Trousers"], ["description", "good for gym activities"], ["stock", 22.0], ["price", 22.0], ["updated_at", "2022-12-01 06:47:43.798894"], ["sku", "GTRS:1456"], ["weight", "40g"], ["id", 1]]
---
	def update
		@product = Product.find(params[:id])
		if @product.update(product_params)