app/views/admin/orders/index.html.erb

			<td><%=order.shipping_address%></td>
			<td><%=order.order_amount%></td>
---
SELECT "orders".* FROM "orders"